{
  "symbol": "CTG.VN",
  "timestamp": "2026-01-09T18:25:13.784887",
  "info": {
    "symbol": "CTG.VN",
    "name": "Vietnam Joint Stock Commercial Bank for Industry and Trade",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "market_cap": 316504125997056,
    "employees": 24769,
    "website": "https://www.vietinbank.vn",
    "description": "Vietnam Joint Stock Commercial Bank for Industry and Trade, together with its subsidiaries, provides various banking products and services to individuals, businesses, and organizations in Vietnam and internationally. The company offers deposits and capital accounts; property, car, and consumer loans, as well as loans for production and business; foreign currency trading services comprising FX spot and forward transactions; account, card payment, and digital banking services; credit, debit, and gift cards; capital financing; payables, receivables, cash, and account management; capital markets; and industry and supply chain services. It also provides investment products; payment and cash flow management, and BankPay services; trade finance and guarantees; treasury products, including interest rate and commodity derivatives, money market, and FI and government debt instruments; and investment banking services. In addition, the company offers life, non-life, re-insurance, and financial investment products; fund management services, including the establishment and management of securities investment funds, management of investment trust portfolios, and securities investment consultancy; securities brokerage, investment advisory, proprietary trading, issuance underwriting, corporate finance advisory, and securities custody; financial leases, working capital loans, and operating leases; and money transfer and exchange, and other remittance services. Further, it trades in gold, silver, and other precious metals; and manages mortgages, pledged assets, collateral valuation, and debt recovery. The company was formerly known as Vietnam Bank for Industry and Trade and changed its name to Vietnam Joint Stock Commercial Bank for Industry and Trade in July 2009. The company is headquartered in Hanoi, Vietnam.",
    "exchange": "VSE",
    "currency": "VND"
  }
}