{
  "symbol": "BID.VN",
  "timestamp": "2026-01-09T18:25:10.502616",
  "info": {
    "symbol": "BID.VN",
    "name": "Joint Stock Commercial Bank for Investment and Development of Vietnam",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "market_cap": 323333694423040,
    "employees": 29816,
    "website": "https://www.bidv.com.vn",
    "description": "Joint Stock Commercial Bank for Investment and Development of Vietnam provides various banking products and services for individuals, corporate customers, and financial institutions in Vietnam. The company accepts various deposit products, such as current accounts, term deposits, current accounts for securities investment and specialized capital deposits, specialized deposits, escrow accounts, valuable papers, and other deposits. It also provides home, auto, study, overseas education, unsecured personal installment, and business loans; pledged, secured personal installment, regular, investment, overdraft, car, and investment, as well as discounted valuable papers; guarantees; and debit and credit cards. In addition, the company offers digital banking, supply chain finance, payment and transfer, cash flow management, management of payables and receivables, life and non-life insurance, and cashier services; securities brokerage and trading services, and derivative securities; business cards; and foreign currency trading and bond issuance consulting services, as well as structured investment products. Further, the company provides trade finance; investment banking services, such as mergers and acquisition advisory, financial restructuring, and equity capital market services; and legal advisory services for small and medium corporate customers, as well as import and export financing services. The company was formerly known as Bank for Investment and Construction of Vietnam and changed its name to Joint Stock Commercial Bank for Investment and Development of Vietnam in 1990. Joint Stock Commercial Bank for Investment and Development of Vietnam was founded in 1957 and is based in Hanoi, Vietnam.",
    "exchange": "VSE",
    "currency": "VND"
  }
}