{
  "symbol": "GAS.VN",
  "timestamp": "2026-01-09T18:25:17.583518",
  "info": {
    "symbol": "GAS.VN",
    "name": "Petrovietnam Gas Joint Stock Corporation",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "market_cap": 234297747308544,
    "employees": 2916,
    "website": "https://www.pvgas.com.vn",
    "description": "Petrovietnam Gas Joint Stock Corporation, together with its subsidiaries, engages in the collection, transportation, processing, storage, distribution, importing, and trading of gas and gas related products in Vietnam. The company offers liquefied petroleum gas, dry gas, condensate, compressed natural gas, and liquefied natural gas; gas cylinders under PetroVietnam brand; and steel pipes products. It also provides gas gathering, importation, and transportation and distribution, converting engines to run on gas, and maintenance and repair services for gas facility equipment; coating services for oil and gas pipelines; and steel pipe services comprising steel plates supply, welding, non-destructing testing, and chemical analysis and mechanical testing services, as well as engages in the construction and installation of equipment and other accessories. In addition, the company is involved in wholesaling solid, liquid and gaseous fuel, and other products; construction activities, including investing, constructing, managing, maintaining, and repairing gas and gas related construction works and projects; real estate business; and investing activities. It supplies its gas to power and fertilizer plants, industrial manufacturers, LPG trading and distributing companies, and transportation and processing industries, as well as to manufacturers of ceramic tiles, steel, and porcelain. The company was formerly known as PetroVietnam Gas Corporation \u0096 One Member Company Limited and changed its name to Petrovietnam Gas Joint Stock Corporation in May 2011. The company was founded in 1990 and is headquartered in Ho Chi Minh City, Vietnam. Petrovietnam Gas Joint Stock Corporation is a subsidiary of Vietnam Oil and Gas Group.",
    "exchange": "VSE",
    "currency": "VND"
  }
}