{
  "symbol": "ACB.VN",
  "timestamp": "2026-01-09T18:25:06.952719",
  "info": {
    "symbol": "ACB.VN",
    "name": "Asia Commercial Joint Stock Bank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "market_cap": 126104912265216,
    "employees": 13022,
    "website": "https://acb.com.vn",
    "description": "Asia Commercial Joint Stock Bank provides various banking products and services to personal and business customers in Vietnam. It offers term and demand deposits, current accounts, time deposit; credit, debit, prepaid, and other cards; and insurance products comprising life, accident, and medical and health insurance services, as well as comprehensive solutions insurance products. The company also provides consumer and business loans, including working capital loans, business loans, loans secured by savings books and valuable papers, fixed asset loans, home mortgage, home construction and renovation loans, secured personal loans, car and auto loans, 247 online disbursements, overdrafts, domestic commercial contract financing, commercial construction contract financing, auto distributor/dealer finance, fixed asset investment/investment project financing, real estate project finance, and project finance for woman-owned small and medium-sized enterprise loan. In addition, it offers international money transfer, online tax payment, foreign currency exchange, forex and financial market products, payment solutions, corporate cards, and bank guarantee services, including domestic, partially unsecured, overseas, joint venture contractor, guarantee for investors, and future balance guarantee services. Further, the company engages in the factoring activities; trust and entrustment activities; bond trading; supply of commodity price derivative products; insurance agent; financial leasing services; securities and account trading services; brokerage and securities investment consulting; depository, corporate financial consulting, and underwriting; debt management; investment fund management and asset exploitation services; and other banking services, as well as provides derivative products and commodities and clearing and settlement services for securities transactions. Asia Commercial Joint Stock Bank was founded in 1993 and is headquartered in Ho Chi Minh City, Vietnam.",
    "exchange": "VSE",
    "currency": "VND"
  }
}