{
  "symbol": "POW.VN",
  "timestamp": "2026-01-09T18:25:35.093116",
  "info": {
    "symbol": "POW.VN",
    "name": "PetroVietnam Power Corporation - JSC",
    "sector": "Utilities",
    "industry": "Utilities - Independent Power Producers",
    "market_cap": 40130312142848,
    "employees": 2156,
    "website": "https://pvpower.vn",
    "description": "PetroVietnam Power Corporation - JSC, together with its subsidiaries, engages in the production and distribution of industrial and consumer electricity in Vietnam. The company manages and operates power plants; provides short-term and specialized training services; offers labor for operation and maintenance of industrial facilities, and power plants; installs electrical systems at construction sites; provides management services for power projects and electrical construction consulting services; offers warehousing and storage of goods; and wholesales solid, liquid, gaseous fuel, and related products. It also constructs power plants and electrical industry projects; constructs and develops power infrastructure, and medium and low voltage grids; invests in and constructs independent power producer projects; constructs, develops, and manages clean development mechanism power projects; purchases electrical systems at construction sites; trades in equipment, materials, and spare parts for electricity production and trading; provides information technology and certified emission reductions from power plants; and researches and applies technological advancements in power project investment and development. The company offers technical, repair, and operation services; human resource training for operation management; and maintenance services for electricity production and business, as well as rents means of transport, cranes, and towing; trades in ash, slag, and scrap products; and imports and exports energy, raw materials, equipment, supplies, and spare parts for electricity production and business. It also imports and exports commodities. The company was incorporated in 2007 and is based in Hanoi, Vietnam. PetroVietnam Power Corporation - JSC is a subsidiary of Vietnam Oil and Gas Group.",
    "exchange": "VSE",
    "currency": "VND"
  }
}