{
  "symbol": "SHB.VN",
  "timestamp": "2026-01-09T18:25:38.197393",
  "info": {
    "symbol": "SHB.VN",
    "name": "Saigon - Hanoi Commercial Joint Stock Bank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "market_cap": 75796601372672,
    "employees": 6786,
    "website": "https://www.shb.com.vn",
    "description": "Saigon - Hanoi Commercial Joint Stock Bank, together with its subsidiaries, provides various banking products and services to individuals and organizations in Vietnam and internationally. It operates through the Credit, Investment, Services, and Treasury segments. The company offers demand, term, and savings deposits; sporting, securities, payment, and current accounts; debit and credit cards; card payment; VIP banking; international and domestic money transfer and receipt, and WU money receipt; mobile, online, phone, and SMS banking; consumer, car, home, business, agricultural product, remittances, and working capital loans, as well as loans mortgaged with valuable paper; business overdraft; and bill collection services. It also provides short-, medium-, and long-term deposits; foreign currency transactions; discounting; factoring; asset preservation, including rental of lockers and safes; bancassurance; and entrust lending transactions. The company offers investment banking; debt and asset management; finance banking; deposit and account management; tax payment, warranty, payment, loan, advance payment refund, contract performance, and bid guarantees, as well as loan arrangement commitments; international settlement and trade finance services; forex trading and treasury services consisting of swaps, forwards, and spots; and investment and hedging services. It provides cash management services; banking and financial consultancy; services of managing; advisory services, as well as engages in trade of negotiable instruments and bonds; the provision of money brokerage services; and issuing certificates of deposit, promissory notes, and treasury bills and bonds. The company was formerly known as Nhon Ai Rural Commercial Joint Stock Bank and changed its name to Saigon - Hanoi Commercial Joint Stock Bank in September 2009. Saigon - Hanoi Commercial Joint Stock Bank was founded in 1993 and is headquartered in Hanoi, Vietnam.",
    "exchange": "VSE",
    "currency": "VND"
  }
}