{
  "symbol": "TPB.VN",
  "timestamp": "2026-01-09T18:25:46.207598",
  "info": {
    "symbol": "TPB.VN",
    "name": "Tien Phong Commercial Joint Stock Bank",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "market_cap": 48823346921472,
    "employees": 7669,
    "website": "https://www.tpb.vn",
    "description": "Tien Phong Commercial Joint Stock Bank provides various banking products and services to individuals and businesses in Vietnam. It accepts current and savings accounts, joint-holders corporate accounts, and term and online deposits. The company's loan products include home loans for house construction and renovation, auto and consumer loans, business loans, non-secured consumer loans, loans secured by valuable papers and saving books, car loans, VND lending, project financing, credit lines, working capital loans, medium and long term loans, loans secured by deposits/certificates of deposit/bonds, loans under export documents, pre-shipment and post-shipment finance, express business lending, and loans based on inventory, as well as secured and non-secured overdrafts. It also offers credit and debit cards; car, home, and life insurance products; inter settlement services, such as import L/C issuance, international remittance, UPAS L/C, overseas fund transfer, import and export collections, L/C issuance, international transfer, and tracking services, as well as discount export documents under L/C, D/P, and TTR; bid-tender, performance, warranty, and advanced payment refund guarantees; and treasury services, including FX swaps, forwards, and spots. In addition, the company provides centralization account management, intermediary, money transfer, tuition collection, premier transaction area, and Internet and mobile banking services. It operates branches, a representative office, and transaction offices. Tien Phong Commercial Joint Stock Bank was founded in 2008 and is headquartered in Hanoi, Vietnam.",
    "exchange": "VSE",
    "currency": "VND"
  }
}