{
  "symbol": "HPG.VN",
  "timestamp": "2026-01-09T18:25:22.471795",
  "info": {
    "symbol": "HPG.VN",
    "name": "Hoa Phat Group Joint Stock Company",
    "sector": "Basic Materials",
    "industry": "Steel",
    "market_cap": 201098103095296,
    "employees": 32780,
    "website": "https://www.hoaphat.com.vn",
    "description": "Hoa Phat Group Joint Stock Company produces and sells steel products in Vietnam. It engages in refining steel; casting steel and iron; trading, import, and export of steel, and steel-producing machinery and equipment; production and trade of industrial steel, including steel sheets, hot rolled steel, cold rolled steel, steel pipes, and steel scrap; and production of steel string machinery. It also produces, trades, and assembles construction equipment and furniture products; and exploits metal, sand, stones, and gravel. In addition, it engages in the civil and industrial construction; trading of real estate under its ownership or lease from others; leasing houses and offices; investing in construction of infrastructure; raising pigs, cows, and poultry; provision of raising services; processing and preserving meat and meat products; producing feeds for cattle, poultry, and aquaculture sector; producing fertilizer and nitrogen compounds; trading agricultural equipment, machineries, and accessories; and other related auxiliary sectors. Further, it is involved in transmitting and distributing electricity; wholesaling solid, liquid, gas fuels and related products; manufacturing metal tanks and containers; producing and trading in coke coal; investing, producing, and trading in electrical home appliances, and construction and mining machines; producing freezers and fridges; and storing, loading, and unloading of goods; repairing and producing mechanical products; leasing machines, equipment, and vehicles; and producing mechanical spare parts. Additionally, it provides post-harvest and hospitality services; warehouses and storage yards for rent; galvanized, color coated, and galvalum steel sheets; coastal and ocean freight, and inland waterway transportation; plantation; transportation agency; security; and sports and entertainment services. Hoa Phat Group Joint Stock Company was founded in 1992 and is headquartered in Hung Yen, Vietnam.",
    "exchange": "VSE",
    "currency": "VND"
  }
}